# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [15]:
import pandas as pd
import numpy as np

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a variable called cars1 and cars2

In [5]:
url1 = r'C:\Program Files\Python36\Scripts\Pandas Tutorial\cars1.csv'
url2 = r'C:\Program Files\Python36\Scripts\Pandas Tutorial\cars2.csv'
cars1 = pd.read_csv(url1)
cars2 = pd.read_csv(url2)
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,NaN,NaN,NaN,NaN,NaN
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,NaN,NaN,NaN,NaN,NaN
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,NaN,NaN,NaN,NaN,NaN
4,17.0,8,302,140,3449,10.5,70,1,ford torino,NaN,NaN,NaN,NaN,NaN

In [6]:
cars2.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,33.0,4,91,53,1795,17.4,76,3,honda civic
1,20.0,6,225,100,3651,17.7,76,1,dodge aspen se
2,18.0,6,250,78,3574,21.0,76,1,ford granada ghia
3,18.5,6,250,110,3645,16.2,76,1,pontiac ventura sj
4,17.5,6,258,95,3193,17.8,76,1,amc pacer d/l

### Step 4. Ops it seems our first dataset has some unnamed blank columns, fix cars1

In [7]:
cars1 = cars1.loc[:, 'mpg':'car']
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 5. What is the number of observations in each dataset?

In [9]:
cars1.shape

(198, 9)

In [10]:
cars2.shape

(200, 9)

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [12]:
# method 1
# use concat() function

frames = [cars1, cars2]
cars = pd.concat(frames)
cars.shape

(398, 9)

In [13]:
# method 2
# use append(), which is a useful shortcut to concat()

cars = cars1.append(cars2)
cars.shape

(398, 9)

### Step 7. Ops there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [16]:
owners = np.random.randint(15000, high=73001, size=cars.shape[0], dtype='l')
# owners

array([27842, 47085, 56332, 57960, 70425, 71420, 23096, 27812, 64232,
       55970, 48191, 51025, 38048, 30217, 34632, 59347, 51247, 20373,
       51331, 40507, 48417, 37434, 69341, 20887, 40867, 18485, 66828,
       35852, 22792, 61403, 52340, 51853, 66642, 69125, 16898, 26238,
       65592, 71076, 48053, 22579, 28038, 32136, 16693, 18280, 20624,
       42184, 34608, 56437, 60324, 63012, 57457, 55536, 60050, 63589,
       37890, 15204, 57521, 48766, 46506, 53859, 25318, 71279, 44293,
       15745, 17348, 31850, 17584, 49973, 60632, 69459, 28256, 15710,
       16856, 51527, 60821, 21457, 41052, 63688, 52746, 69016, 16868,
       54769, 55995, 50595, 26453, 17985, 56774, 22802, 51297, 54210,
       28153, 68518, 55883, 38014, 24671, 70782, 23949, 24854, 46043,
       38631, 27923, 37531, 45866, 66333, 27301, 68822, 40638, 17955,
       66267, 56783, 63262, 37943, 52237, 64911, 38720, 23604, 42560,
       21256, 27472, 49287, 47665, 39020, 16720, 65148, 16755, 69310,
       27023, 51911, 23549, 65579, 33781, 56088, 28072, 16891, 17778,
       35293, 26341, 52955, 58129, 31514, 17723, 36514, 32734, 72217,
       69884, 63144, 25734, 16896, 17399, 29870, 47984, 27105, 35529,
       64959, 26261, 21582, 29723, 49716, 71668, 41118, 60260, 58459,
       45692, 21946, 55967, 44811, 41543, 30694, 31798, 61318, 26050,
       26105, 68631, 31052, 32496, 43191, 28078, 49213, 67827, 15526,
       60319, 71375, 50377, 58415, 32035, 55585, 48323, 24827, 27880,
       22052, 48295, 67716, 34162, 52156, 61602, 18081, 55745, 33958,
       60802, 25068, 42066, 58175, 23817, 49074, 54733, 21218, 15646,
       45901, 67925, 41453, 30947, 56238, 57317, 16136, 50838, 53800,
       16232, 46245, 24916, 54350, 39445, 67621, 57557, 35183, 16076,
       21357, 25516, 15481, 23560, 71927, 49389, 35021, 40109, 32249,
       69546, 66806, 39712, 55284, 68245, 33925, 50295, 49606, 38787,
       20013, 64800, 45988, 64238, 21147, 36698, 22081, 25537, 19845,
       59126, 69226, 36096, 54212, 29902, 18057, 30708, 50343, 57844,
       70531, 20771, 21144, 50654, 61490, 39252, 45884, 56404, 39909,
       16311, 62684, 40935, 30816, 24459, 58627, 65942, 20986, 48396,
       51257, 42144, 40173, 59909, 28880, 39680, 69018, 21314, 60223,
       39229, 34407, 68860, 39481, 63857, 58162, 66391, 66149, 22330,
       16935, 32301, 22026, 32895, 19773, 68383, 41106, 66999, 71748,
       17847, 53988, 62061, 43184, 22497, 16761, 71764, 31296, 22655,
       33427, 58512, 18137, 18243, 33700, 47948, 48084, 68425, 50937,
       57561, 41283, 27031, 53155, 72610, 20031, 15585, 47584, 67856,
       56968, 24025, 26927, 18587, 61182, 39049, 63783, 69027, 55522,
       33591, 61465, 61008, 59825, 59977, 70169, 66567, 50096, 49777,
       56383, 45757, 17707, 47875, 53207, 28862, 42222, 66463, 57458,
       61092, 58327, 32426, 60850, 63166, 18214, 50167, 53771, 67322,
       60008, 40323, 35054, 56105, 60981, 57392, 47153, 20668, 46680,
       58130, 47925, 61400, 50597, 37130, 48803, 37176, 68646, 15780,
       70826, 34957, 40009, 60923, 62595, 50648, 29682, 72443, 69983,
       52745, 26610])

### Step 8. Add the column owners to cars

In [17]:
cars['owners'] = owners
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,27842
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,47085
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,56332
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,57960
4,17.0,8,302,140,3449,10.5,70,1,ford torino,70425